---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrentPhaseA
source: html/ace20df8-ef31-4ff6-0909-0a2ac3210f5a.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrentPhaseA Property

The TrueCurrentPhaseA value of the Electrical System.

## Syntax (C#)
```csharp
public double TrueCurrentPhaseA { get; }
```

## Remarks
This property is used to retrieve the TrueCurrentPhaseA value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!